#좌우상하 이동
dx=[-1,1,0,0]
dy=[0,0,1,-1]

matrix=[
    [0,   1,   2,   3,   4], 
    [5,   6,   7,   8,  9], 
    [10, 11,  12,  13, 14], 
    [15, 16,  17,  18, 19], 
    [20,21, 22,  23, 24]
    ]

#8방 탐색 
dx=[-1,-1,-1,0,1,1,1,0]
dy=[-1,0,1,1,1,0,-1,-1]
#현재 행렬의 크기
n,m=5,5
#print(f"matrix[{n}][{m}]=",matrix[n][m])

#이중 반복문 순회
for x in range(n):
    for y in range(m):
        #델타값을 이용해 8방향 탐색        
        for i in range(8):
            r=x+dx[i]
            c=y+dy[i]
            #행렬의 범위를 벗어 나지 않아야함
            if 0<=r<5 and 0<=c<5: 
                print(f"matrix[{r}][{c}]=",matrix[r][c])
